# colo_emojis.py
colo_emojis = {
    "US": "🇺🇸",
    "SJC": "🇺🇸",  # 圣何塞
    "LAX": "🇺🇸",  # 洛杉矶
    "SEA": "🇺🇸",  # 西雅图
    "JFK": "🇺🇸",  # 纽约 - 肯尼迪国际机场
    "ORD": "🇺🇸",  # 芝加哥 - 奥黑尔国际机场
    "DFW": "🇺🇸",  # 达拉斯 - 沃斯堡国际机场
    "MIA": "🇺🇸",  # 迈阿密国际机场
    "ATL": "🇺🇸",  # 亚特兰大国际机场
    "US": "🇺🇸",  # 美国

    # 德国
    "TXL": "🇩🇪",  # 柏林泰格尔机场
    "SXF": "🇩🇪",  # 柏林舍内费尔德机场
    "BER": "🇩🇪",  # 柏林勃兰登堡机场
    "MUC": "🇩🇪",  # 慕尼黑机场
    "FRA": "🇩🇪",  # 法兰克福机场
    "HAM": "🇩🇪",  # 汉堡机场
    "CGN": "🇩🇪",  # 科隆/波恩机场
    "STR": "🇩🇪",  # 斯图加特机场
    "DUS": "🇩🇪",  # 杜塞尔多夫机场
    "LEJ": "🇩🇪",  # 莱比锡/哈雷机场
    "NUE": "🇩🇪",  # 纽伦堡机场
    "HAJ": "🇩🇪",  # 汉诺威机场
    "BRE": "🇩🇪",  # 不来梅机场
    "DRS": "🇩🇪",  # 德累斯顿机场
    "DE": "🇩🇪",  # 德国

    # 日本
    "NRT": "🇯🇵",  # 东京成田
    "HND": "🇯🇵",  # 东京羽田
    "KIX": "🇯🇵",  # 大阪关西国际机场
    "CTS": "🇯🇵",  # 札幌新千岁机场
    "FUK": "🇯🇵",  # 福冈机场
    "NGO": "🇯🇵",  # 名古屋中部国际机场
    "OKA": "🇯🇵",  # 冲绳那霸机场
    "JP": "🇯🇵",  # 日本

    # 香港
    "HKG": "🇭🇰",  # 香港国际机场
    "HK": "🇭🇰",  # 香港

    # 韩国
    "ICN": "🇰🇷",  # 仁川国际机场
    "PUS": "🇰🇷",  # 釜山金海机场
    "GMP": "🇰🇷",  # 首尔金浦机场
    "CJU": "🇰🇷",  # 济州机场
    "TAE": "🇰🇷",  # 大邱机场
    "KR": "🇰🇷",  # 韩国

    # 台湾
    "TPE": "🇹🇼",  # 台北桃园机场
    "TSA": "🇹🇼",  # 台北松山机场
    "KHH": "🇹🇼",  # 高雄国际机场
    "RMQ": "🇹🇼",  # 台中清泉岗机场
    "TW": "🇹🇼",  # 台湾

    # 新加坡
    "SIN": "🇸🇬",   # 樟宜机场
    "SG": "🇸🇬",  # 新加坡

    # CF优选
    "CF优选": "☁️"  # CF优选
}